<!DOCTYPE html>
<html lang="pt-br">

<head>
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta charset="UTF-8">
  <meta content="width=device-width,initial-scale=1" name="viewport">
  <meta content="index, follow" name="robots">
  <meta content="Portuguese" name="language">
  <meta content="Eduardo Lara" name="author">


  <title>Você Certificado AWS: Da Nuvem à Certificação</title>

  <script src="https://cdn.jsdelivr.net/npm/js-cookie@3.0.1/dist/js.cookie.min.js"></script>
  <script>document.addEventListener("DOMContentLoaded", function () { if (!Cookies.get("cookie_consent")) { var e = document.createElement("div"); e.className = "cookie-consent-banner", e.innerHTML = '<p>Este site utiliza cookies do Google, para garantir a melhor experiência possível. Saiba o motivo do uso na <a href="https://policies.google.com/privacy#infocollect" target="_blank">Política de Privacidade</a>.</p><button class="cookie-consent-button">Ok, entendi</button>', document.body.appendChild(e), e.querySelector(".cookie-consent-button").addEventListener("click", function () { Cookies.set("cookie_consent", "true", { expires: 365 }), e.remove() }) } })</script>
  <script src="js/main.min.js"></script>

  <link rel="stylesheet" href="css/main.css">
  <link rel="shortcut icon" type="image/png" href="imagens/favicon.png">

  <style type="text/css">
    .cookie-consent-banner {
      position: fixed;
      bottom: 0;
      left: 0;
      width: 100%;
      background-color: #f0f0f0;
      padding: 5px;
      text-align: center;
      font-family: "Lucida Sans Unicode", "Lucida Grande", sans-serif
    }

    .cookie-consent-button {
      background-color: orange;
      border: none;
      color: #000;
      font-weight: 700;
      padding: 5px 15px;
      border-radius: 3px;
      cursor: pointer;
      font-family: "Lucida Sans Unicode", "Lucida Grande", sans-serif
    }

    .centralizado {
      display: block;
      margin-left: auto;
      margin-right: auto;
    }
  </style>

</head>

<body>
  <header id="header" class="uk-position-relative uk-background-top-center uk-background-cover uk-background-norepeat"
    style="background-color:#000;background-image:url(imagens/fundo.jpg)">
    <nav class="uk-navbar-container uk-navbar-transparent uk-light">
      <div id="topo" class="uk-container">
        <div data-uk-navbar>
          <div class="uk-navbar-left"><a class="uk-navbar-item uk-logo" href="/"><img class="uk-logo-inverse"
                src="imagens/vocecertificadoaws_logo.png" alt="Cursos Você Certificado AWS"> <img
                src="imagens/vocecertificadoaws_logo.png" alt="Cursos Você Certificado AWS"></a>
            <ul class="uk-navbar-nav uk-visible@m"></ul>
          </div>
          <div class="uk-navbar-center">
            <ul class="uk-navbar-nav uk-visible@m"></ul>
          </div>
          <div class="uk-navbar-right">
            <ul class="uk-navbar-nav uk-visible@m" data-uk-scrollspy-nav="closest: li; scroll: true">
              <li><a href="index.html#cursos">CURSOS AWS</a></li>
              <li><a href="index.html#novidades">NOVIDADES</a></li>
              <li><a href="guias.html#guias">GUIAS DE ESTUDO</a></li>
              <li><a href="index.html#depoimentos">DEPOIMENTOS</a></li>
              <li><a href="index.html#instrutor">INSTRUTOR</a></li>
              <li><a href="index.html#faq">PERGUNTAS FREQUENTES</a></li>
              <li><a href="contato.html">CONTATO</a></li>
            </ul><a class="uk-navbar-toggle uk-hidden@m" href="#nav-mobile" aria-label="Mobile Navigation"
              data-uk-navbar-toggle-icon data-uk-toggle></a>
          </div>
        </div>
      </div>
    </nav>
    <div class="uk-position-relative uk-container uk-container-xsmall">
      <div class="uk-section uk-section-medium uk-width-1-1 uk-light" data-uk-parallax="y: 100;"
        data-uk-scrollspy="cls: uk-animation-slide-bottom-medium; repeat: true">
        <div class="uk-flex uk-text-center uk-flex-middle uk-flex-center">
          <div class="uk-width-1-1">
            <h1 class="uk-heading-medium" style>VOCÊ CERTIFICADO AWS</h1>
            <div class="uk-text-lead" style>Do básico ao avançado, para você passar na prova de certificação!</div>
            <div class="uk-margin-medium-top"></div>
          </div>
        </div>
      </div>
    </div>
  </header>

  <div class="uk-visible@m" uk-sticky="sel-target: .uk-navbar-container; cls-active: uk-navbar-sticky; bottom: #other">
    <nav class="uk-navbar-container" uk-navbar>
      <div class="uk-navbar-center">
        <ul class="uk-navbar-nav" data-uk-scrollspy-nav="closest: li; scroll: true; offset: 100">
          <li><a href="index.html#cursos">CURSOS AWS</a></li>
          <li><a href="index.html#novidades">NOVIDADES</a></li>
          <li><a href="guias.html#guias">GUIAS DE ESTUDO</a></li>
          <li><a href="index.html#depoimentos">DEPOIMENTOS</a></li>
          <li><a href="index.html#instrutor">INSTRUTOR</a></li>
          <li><a href="index.html#faq">PERGUNTAS FREQUENTES</a></li>
          <li><a href="contato.html">CONTATO</a></li>
        </ul>
      </div>
    </nav>
  </div>

  <div id="guias" class="uk-cover-container uk-section-muted" style>
    <div class="uk-section uk-section-large">
      <div class="uk-container uk-position-relative">
        <h2 class="uk-h1 uk-text-center">SEGURANÇA</h2>

        <div>
          <p>A&nbsp;<strong>Nuvem AWS</strong>&nbsp;possibilita um modelo de&nbsp;<a
              href="http://127.0.0.1:5500/responsabilidade-compartilhada.html">responsabilidade compartilhada</a>.</p>

          <p>A AWS gerencia a seguran&ccedil;a&nbsp;<strong>DA</strong>&nbsp;nuvem; voc&ecirc; &eacute;
            respons&aacute;vel pela seguran&ccedil;a&nbsp;<strong>NA</strong>&nbsp;nuvem.</p>

          <p>Voc&ecirc; mant&eacute;m o controle da seguran&ccedil;a que escolhe implementar para proteger seu
            pr&oacute;prio conte&uacute;do, plataforma, aplicativos, sistemas e redes, da mesma forma que faria em um
            centro de dados local.</p>

          <h2>Benef&iacute;cios da Seguran&ccedil;a AWS</h2>

          <table align="center" border="1" cellpadding="2" cellspacing="2" style="width:100%">
            <thead>
              <tr>
                <th style="text-align:center"><strong>Aplica&ccedil;&atilde;o</strong></th>
                <th style="text-align:center"><strong>Benef&iacute;cio</strong></th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td style="text-align:center">Mantenha seus dados seguros</td>
                <td>A infraestrutura AWS implementa s&oacute;lidas prote&ccedil;&otilde;es para garantir a
                  seguran&ccedil;a dos seus dados, armazenando-os em data centers altamente seguros.</td>
              </tr>
              <tr>
                <td style="text-align:center">Atenda aos requisitos de conformidade</td>
                <td>A AWS gerencia dezenas de programas de conformidade em sua infraestrutura, simplificando o caminho
                  para atender aos requisitos regulat&oacute;rios, com segmentos significativos da conformidade
                  j&aacute; conclu&iacute;dos.</td>
              </tr>
              <tr>
                <td style="text-align:center">Economize dinheiro</td>
                <td>Reduza custos ao utilizar os data centers eficientes da AWS, mantendo um alto padr&atilde;o de
                  seguran&ccedil;a sem a necessidade de gerenciar instala&ccedil;&otilde;es pr&oacute;prias.</td>
              </tr>
              <tr>
                <td style="text-align:center">Dimensione rapidamente</td>
                <td>A seguran&ccedil;a na Nuvem AWS se adapta dinamicamente ao crescimento do seu neg&oacute;cio.
                  Independentemente do tamanho da sua empresa, a infraestrutura da AWS &eacute; projetada para manter
                  seus dados seguros enquanto voc&ecirc; dimensiona rapidamente suas opera&ccedil;&otilde;es.</td>
              </tr>
            </tbody>
          </table>

          <h2>Conformidade</h2>

          <p>A&nbsp;<strong>Conformidade com a Nuvem AWS</strong>&nbsp;permite que voc&ecirc; compreenda os controles
            robustos implementados pela AWS para manter a seguran&ccedil;a e prote&ccedil;&atilde;o de dados na nuvem.
          </p>

          <p>Conforme os sistemas s&atilde;o constru&iacute;dos sobre a infraestrutura da Nuvem AWS, as
            responsabilidades de conformidade ser&atilde;o compartilhadas.</p>

          <h3>Os programas de conformidade incluem:</h3>

          <ul>
            <li>Certifica&ccedil;&otilde;es / atesta&ccedil;&otilde;es.</li>
            <li>Leis, regulamenta&ccedil;&otilde;es e privacidade.</li>
            <li>Alinhamentos / estruturas.</li>
          </ul>

          <h2>AWS Artifact</h2>

          <p>O&nbsp;<strong>AWS Artifact</strong>&nbsp;&eacute; sua principal fonte de informa&ccedil;&otilde;es
            relacionadas &agrave; conformidade relevantes para voc&ecirc;.</p>

          <p>Ele fornece acesso sob demanda aos relat&oacute;rios de seguran&ccedil;a e conformidade da AWS e a acordos
            online selecionados.</p>

          <p>Os relat&oacute;rios dispon&iacute;veis no AWS Artifact incluem nossos relat&oacute;rios
            de&nbsp;<strong>Controle de Organiza&ccedil;&atilde;o de Servi&ccedil;os (SOC)</strong>, relat&oacute;rios
            de&nbsp;<strong>Ind&uacute;stria de Cart&otilde;es de Pagamento (PCI)</strong>&nbsp;e
            certifica&ccedil;&otilde;es de &oacute;rg&atilde;os de acredita&ccedil;&atilde;o em v&aacute;rias geografias
            e verticais de conformidade, que validam a implementa&ccedil;&atilde;o e efic&aacute;cia operacional dos
            controles de seguran&ccedil;a da AWS.</p>

          <p>Os acordos dispon&iacute;veis no AWS Artifact incluem o Adendo de Associado Comercial (BAA) e o Acordo de
            N&atilde;o Divulga&ccedil;&atilde;o (NDA).</p>

          <h2>Amazon GuardDuty</h2>

          <p>O&nbsp;<strong>Amazon GuardDuty</strong>&nbsp;oferece detec&ccedil;&atilde;o de amea&ccedil;as e
            monitoramento cont&iacute;nuo de seguran&ccedil;a para comportamentos maliciosos ou n&atilde;o autorizados,
            ajudando a proteger suas contas e cargas de trabalho da AWS.</p>

          <p>Servi&ccedil;o de detec&ccedil;&atilde;o de amea&ccedil;as inteligente.</p>

          <p>Detecta comprometimento de conta, comprometimento de inst&acirc;ncia, reconhecimento malicioso e
            comprometimento de bucket.</p>

          <img src="imagens/amazon-guardduty.jpg" alt="Amazon GuardDuty" width="90%" class="centralizado" border="1">

          <h3>Monitoramento cont&iacute;nuo de eventos em:</h3>

          <ul>
            <li>
              <p><strong>Eventos do AWS CloudTrail:</strong> GuardDuty analisa eventos do AWS CloudTrail para
                detec&ccedil;&atilde;o de amea&ccedil;as.</p>
            </li>
            <li>
              <p><strong>Amazon Virtual Private Cloud (Amazon VPC) Flow Logs:</strong> Utiliza logs de fluxo da Amazon
                VPC para an&aacute;lise de atividades.</p>
            </li>
            <li>
              <p><strong>Logs de Consulta DNS:</strong> Examina logs de consulta DNS em busca de padr&otilde;es
                suspeitos.</p>
            </li>
            <li>
              <p><strong>Eventos do Amazon Simple Storage Service (Amazon S3):</strong> Coleta eventos do plano de dados
                do Amazon S3 para refor&ccedil;ar a seguran&ccedil;a.</p>
            </li>
            <li>
              <p><strong>Logs de Auditoria do Amazon Elastic Kubernetes Service (Amazon EKS):</strong> Monitora a
                atividade do plano de controle do Amazon EKS por meio da an&aacute;lise de logs de auditoria do
                Kubernetes.</p>
            </li>
            <li>
              <p><strong>Prote&ccedil;&atilde;o contra Malware no Amazon Elastic Block Store (EBS):</strong>
                Lan&ccedil;ou a prote&ccedil;&atilde;o contra malware no Amazon EBS para escanear arquivos maliciosos em
                inst&acirc;ncias EC2 ou cargas de trabalho de cont&ecirc;ineres usando volumes EBS.</p>
            </li>
            <li>
              <p><strong>Prote&ccedil;&atilde;o Amazon RDS:</strong> Identifica potenciais amea&ccedil;as aos dados
                armazenados em bancos de dados Amazon Aurora, agora dispon&iacute;vel geralmente.</p>
            </li>
          </ul>

          <h2>AWS WAF</h2>

          <p>O&nbsp;<strong>AWS WAF</strong>&nbsp;&eacute; um firewall de aplicativos da web.</p>

          <p>Protege contra exploits comuns que poderiam comprometer a disponibilidade do aplicativo, comprometer a
            seguran&ccedil;a ou consumir recursos excessivos.</p>

          <p>O WAF permite que voc&ecirc; crie regras para filtrar o tr&aacute;fego da web com base em
            condi&ccedil;&otilde;es que incluem endere&ccedil;os IP, cabe&ccedil;alhos e corpo HTTP ou URIs
            personalizados.</p>

          <img src="imagens/aws-waf-funcionamento.jpg" alt="AWS WAF Funcionamento" width="70%" class="centralizado"
            border="1">

          <p>O WAF facilita a cria&ccedil;&atilde;o de regras que bloqueiam exploits comuns da web, como
            inje&ccedil;&atilde;o de SQL e script entre sites. As regras s&atilde;o conhecidas como ACLs da Web.</p>

          <h2>AWS Shield</h2>

          <p>O&nbsp;<strong>AWS Shield</strong>&nbsp;&eacute; um servi&ccedil;o gerenciado de prote&ccedil;&atilde;o
            contra nega&ccedil;&atilde;o de servi&ccedil;o distribu&iacute;do (DDoS).</p>

          <p>Salvaguarda aplicativos da web em execu&ccedil;&atilde;o na AWS com detec&ccedil;&atilde;o sempre ativa e
            mitiga&ccedil;&atilde;o autom&aacute;tica em linha.</p>

          <p>Ajuda a minimizar a indisponibilidade e lat&ecirc;ncia do aplicativo.</p>

          <h3>Dois n&iacute;veis dispon&iacute;veis:</h3>

          <ul>
            <li><strong>Padr&atilde;o</strong>, que &eacute; gratu&iacute;to e dispon&iacute;vel automaticamente em
              todas as contas</li>
            <li><strong>Avan&ccedil;ado</strong>., que &eacute; pago,&nbsp;cont&eacute;m suporte 24/7 e amplia a
              prote&ccedil;&atilde;o do seu ambiente.</li>
          </ul>

          <h2>Servi&ccedil;o de Gerenciamento de Chaves AWS (AWS KMS)</h2>

          <p>O&nbsp;<strong>Servi&ccedil;o de Gerenciamento de Chaves AWS</strong>&nbsp;oferece controle centralizado
            sobre as chaves de criptografia usadas para proteger seus dados.</p>

          <p>Voc&ecirc; pode criar, importar, rotacionar, desativar, excluir, definir pol&iacute;ticas de uso e auditar
            o uso de chaves de criptografia usadas para criptografar seus dados.</p>

          <p>O&nbsp;<strong>AWS KMS</strong>&nbsp;est&aacute; integrado &agrave; maioria dos outros servi&ccedil;os da
            AWS, facilitando a criptografia dos dados armazenados nesses servi&ccedil;os com chaves de criptografia que
            voc&ecirc; controla.</p>

          <p>O&nbsp;<strong>AWS KMS</strong>&nbsp;est&aacute; integrado ao&nbsp;<strong>AWS CloudTrail</strong>, que
            fornece a capacidade de auditar quem usou quais chaves, em quais recursos e quando.</p>

          <p>O&nbsp;<strong>AWS KMS</strong>&nbsp;permite que os desenvolvedores criptografem facilmente dados, seja por
            meio de criptografia em um clique no Console de Gerenciamento da AWS ou usando o&nbsp;<strong>AWS
              SDK</strong>&nbsp;para adicionar facilmente a criptografia no c&oacute;digo de sua
            aplica&ccedil;&atilde;o.</p>

          <h2>AWS CloudHSM</h2>

          <p>O&nbsp;<strong>AWS CloudHSM</strong>&nbsp;&eacute; um m&oacute;dulo de seguran&ccedil;a de
            <strong>hardware</strong> (HSM) baseado em nuvem que permite gerar e usar facilmente suas pr&oacute;prias
            chaves de criptografia na Nuvem AWS.
          </p>

          <p>Com o&nbsp;<strong>CloudHSM</strong>, voc&ecirc; pode gerenciar suas pr&oacute;prias chaves de criptografia
            usando HSMs validados pelo FIPS 140-2 N&iacute;vel 3.</p>

          <p>O&nbsp;<strong>CloudHSM</strong>&nbsp;oferece a flexibilidade de integrar-se &agrave;s suas
            aplica&ccedil;&otilde;es usando APIs padr&atilde;o do setor, como PKCS#11, Extens&otilde;es de Criptografia
            Java (JCE) e bibliotecas Microsoft CryptoNG (CNG).</p>

          <p>Exemplos de HSM:</p>

          <img src="imagens/exemplos-hsm.jpg" alt="Exemplos de HSM" width="70%" class="centralizado" border="1">

          <h2>AWS Certificate Manager (Gerenciador de Certificados AWS)</h2>

          <p>O&nbsp;<strong>Gerenciador de Certificados AWS</strong>&nbsp;&eacute; um servi&ccedil;o que permite
            provisionar, gerenciar e implantar facilmente certificados&nbsp;<strong>Secure Sockets Layer/Transport Layer
              Security (SSL/TLS)</strong>&nbsp;p&uacute;blicos e privados para uso com servi&ccedil;os da AWS e recursos
            conectados internamente.</p>

          <p>Os certificados SSL/TLS s&atilde;o usados para garantir as comunica&ccedil;&otilde;es de rede e estabelecer
            a identidade de sites na Internet, bem como de recursos em redes privadas.</p>

          <p>O&nbsp;<strong>AWS Certificate Manager</strong>&nbsp;elimina o processo manual demorado de compra, upload e
            renova&ccedil;&atilde;o de certificados&nbsp;<strong>SSL/TLS</strong>.</p>

          <h2>AWS Inspector</h2>

          <p>O&nbsp;<strong>Inspector</strong>&nbsp;&eacute; um servi&ccedil;o automatizado de avalia&ccedil;&atilde;o
            de seguran&ccedil;a que ajuda a melhorar a seguran&ccedil;a e conformidade de aplicativos implantados na
            AWS.</p>

          <p>O Inspector avalia automaticamente aplicativos em busca de vulnerabilidades ou desvios das melhores
            pr&aacute;ticas.</p>

          <p>Usa um agente instalado em inst&acirc;ncias&nbsp;<strong style="font-size:13px">EC2</strong><span
              style="font-size:13px">.</span></p>

          <p>As inst&acirc;ncias devem ser marcadas.</p>

          <h3>AWS Trusted Advisor</h3>

          <p>O&nbsp;<strong>AWS Trusted Advisor</strong>&nbsp;&eacute; um recurso online que ajuda a reduzir custos,
            aumentar o desempenho e melhorar a seguran&ccedil;a otimizando seu ambiente AWS.</p>

            <img src="imagens/aws-trusted-advisor-otimizacao-custos.jpg" alt="AWS Trusted Advisor" height="50%"
            class="centralizado" border="1">

          <p align="center">Imagem exemplo, da categoria de otimiza&ccedil;&atilde;o de custos, que apresenta 16
            verifica&ccedil;&otilde;es (verdes) que n&atilde;o apresentam problemas.</p>

            <p>Os planos de suporte básico e developer oferecem verificações básicas de segurança limitadas. Para ter
              acesso a um conjunto completo de verificações, é necessário ter o Trusted Advisor no plano de suporte
              Business ou superior. </p>

          <p>O Trusted Advisor examina sua infraestrutura AWS e a compara com as melhores pr&aacute;ticas da AWS em seis
            categorias:</p>

          <ol>
            <li>
              <p><strong>Otimiza&ccedil;&atilde;o de custos</strong></p>

              <ul>
                <li>
                  <p>Recomenda&ccedil;&otilde;es que podem economizar dinheiro.</p>
                </li>
                <li>
                  <p>Essas verifica&ccedil;&otilde;es destacam recursos n&atilde;o utilizados e oportunidades para
                    reduzir sua fatura.</p>
                </li>
              </ul>
            </li>
            <li>
              <p><strong>Performance (desempenho)</strong></p>

              <ul>
                <li>
                  <p>Recomenda&ccedil;&otilde;es que podem melhorar a velocidade e a capacidade de resposta de suas
                    aplica&ccedil;&otilde;es.</p>
                </li>
              </ul>
            </li>
            <li>
              <p><strong>Seguran&ccedil;a</strong></p>

              <ul>
                <li>
                  <p>Recomenda&ccedil;&otilde;es para configura&ccedil;&otilde;es de seguran&ccedil;a que podem tornar a
                    solu&ccedil;&atilde;o da AWS mais segura.</p>
                </li>
              </ul>
            </li>
            <li>
              <p><strong>Toler&acirc;ncia a falhas</strong></p>

              <ul>
                <li>
                  <p>Recomenda&ccedil;&otilde;es que ajudam a aumentar a resili&ecirc;ncia da sua solu&ccedil;&atilde;o
                    da AWS.</p>
                </li>
                <li>
                  <p>Essas verifica&ccedil;&otilde;es destacam defici&ecirc;ncias de redund&acirc;ncia e recursos usados
                    em excesso.</p>
                </li>
              </ul>
            </li>
            <li>
              <p><strong>Limites de servi&ccedil;o</strong></p>

              <ul>
                <li>
                  <p>Verifica o uso de sua conta e se sua conta se aproxima ou excede o limite (tamb&eacute;m conhecido
                    como cotas) para servi&ccedil;os e recursos da AWS.</p>
                </li>
              </ul>
            </li>
            <li>
              <p><strong>Excel&ecirc;ncia operacional</strong></p>

              <ul>
                <li>
                  <p>Recomenda&ccedil;&otilde;es para ajud&aacute;-lo a operar seu AWS ambiente de forma eficaz e em
                    grande escala.</p>
                </li>
              </ul>
            </li>
          </ol>

          

          <h2>Teste de Penetra&ccedil;&atilde;o</h2>

          <p>O teste de penetra&ccedil;&atilde;o &eacute; a pr&aacute;tica de testar a seguran&ccedil;a de sua
            pr&oacute;pria aplica&ccedil;&atilde;o em busca de vulnerabilidades simulando um ataque.</p>

          <p>A&nbsp;<strong>AWS permite testes de penetra&ccedil;&atilde;o</strong>. Existe um conjunto limitado de
            recursos nos quais os testes de penetra&ccedil;&atilde;o podem ser realizados.</p>

          <h3>Voc&ecirc; n&atilde;o precisa de permiss&atilde;o para realizar testes de penetra&ccedil;&atilde;o nos
            seguintes servi&ccedil;os:</h3>

          <ul>
            <li>Inst&acirc;ncias&nbsp;<strong>Amazon EC2</strong>,&nbsp;<strong>NAT
                Gateways</strong>&nbsp;e&nbsp;<strong>Elastic Load Balancers</strong>.</li>
            <li><strong>Amazon RDS</strong>.</li>
            <li><strong>Amazon CloudFront</strong>.</li>
            <li><strong>Amazon Aurora</strong>.</li>
            <li>Port&otilde;es de API da&nbsp;<strong>Amazon</strong>.</li>
            <li>Fun&ccedil;&otilde;es&nbsp;<strong>AWS Lambda</strong>&nbsp;e fun&ccedil;&otilde;es&nbsp;<strong>Lambda
                Edge</strong>.</li>
            <li>Recursos&nbsp;<strong>Amazon LightSail</strong>.</li>
            <li>Ambientes&nbsp;<strong>Amazon Elastic Beanstalk</strong>.</li>
          </ul>

          <h3>Em caso de conta comprometida:</h3>

          <ol>
            <li>Altere a senha da sua conta raiz da AWS.</li>
            <li>Altere todas as senhas dos usu&aacute;rios do IAM.</li>
            <li>Exclua ou rotacione todas as chaves de acesso program&aacute;tico (API).</li>
            <li>Exclua quaisquer recursos em sua conta que voc&ecirc; n&atilde;o tenha criado.</li>
            <li>Responda a quaisquer notifica&ccedil;&otilde;es recebidas da AWS por meio do Centro de Suporte da AWS
              e/ou entre em contato com o Suporte da AWS para abrir um chamado de suporte.</li>
          </ol>

          <h2>Logon &Uacute;nico da AWS (AWS SSO)</h2>

          <p>O&nbsp;<strong>Logon &Uacute;nico da AWS (AWS SSO)</strong>&nbsp;&eacute; um servi&ccedil;o de logon
            &uacute;nico (SSO) baseado em nuvem que facilita o gerenciamento centralizado do acesso SSO a todas as suas
            contas AWS e aplicativos de nuvem.</p>

          <p>Ele ajuda a gerenciar o acesso SSO e as permiss&otilde;es do usu&aacute;rio em todas as suas contas AWS
            em&nbsp;<strong>Organiza&ccedil;&otilde;es da AWS</strong>.</p>

          <p>O&nbsp;<strong>AWS SSO</strong>&nbsp;tamb&eacute;m ajuda a gerenciar o acesso e as permiss&otilde;es a
            aplicativos de software como servi&ccedil;o (SaaS) comumente usados, aplicativos integrados
            ao&nbsp;<strong>AWS SSO</strong>, bem como aplicativos personalizados que suportam a&nbsp;<strong>Linguagem
              de Marca&ccedil;&atilde;o de Assertividade de Seguran&ccedil;a (SAML) 2.0</strong>.</p>

          <p>O&nbsp;<strong>AWS SSO</strong>&nbsp;inclui um portal do usu&aacute;rio onde seus usu&aacute;rios finais
            podem encontrar e acessar todas as suas contas AWS atribu&iacute;das, aplicativos de nuvem e aplicativos
            personalizados em um s&oacute; lugar.</p>

          <h2>Amazon Cognito</h2>

          <p>O&nbsp;<strong>Amazon Cognito</strong>&nbsp;permite que voc&ecirc; adicione facilmente registro de
            usu&aacute;rios, login e controle de acesso aos seus aplicativos web e m&oacute;veis.</p>

          <p>O&nbsp;<strong>Amazon Cognito</strong>&nbsp;escala para milh&otilde;es de usu&aacute;rios e oferece suporte
            ao login por meio de provedores de identidade social, como Apple, Facebook, Google e Amazon, al&eacute;m de
            provedores de identidade corporativos via SAML 2.0 e OpenID Connect.</p>

          <p>Os dois principais componentes do&nbsp;<strong>AWS Cognito</strong>&nbsp;s&atilde;o os&nbsp;<em>user
              pools</em>&nbsp;e&nbsp;<em>identity pools</em>:</p>

          <ul>
            <li><em>User pools</em>&nbsp;s&atilde;o diret&oacute;rios de usu&aacute;rios que fornecem
              op&ccedil;&otilde;es de registro e login para os usu&aacute;rios do seu aplicativo.</li>
            <li><em>Identity pools</em>&nbsp;permitem que voc&ecirc; conceda aos seus usu&aacute;rios acesso a outros
              servi&ccedil;os da AWS.</li>
            <li>Voc&ecirc; pode usar&nbsp;<em>identity pools</em>&nbsp;e&nbsp;<em>user pools</em>&nbsp;separadamente ou
              juntos.</li>
          </ul>

          <h2>AWS Directory Services</h2>

          <p>A AWS oferece v&aacute;rios tipos de diret&oacute;rios.</p>

          <p>Os tr&ecirc;s tipos a seguir s&atilde;o os que aparecem atualmente no exame e ser&atilde;o abordados nesta
            p&aacute;gina:</p>

          <table align="center" border="1" cellpadding="2" cellspacing="2" style="width:100%">
            <thead>
              <tr>
                <th style="text-align:center">Op&ccedil;&atilde;o de Servi&ccedil;o de Diret&oacute;rio</th>
                <th style="text-align:center">Descri&ccedil;&atilde;o</th>
                <th style="text-align:center">Caso de Uso</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td style="text-align:center">AWS Directory Service for Microsoft Active Directory</td>
                <td>AD Microsoft completo gerenciado pela AWS, executando o Windows Server 2012 R2</td>
                <td>Empresas que desejam um AD Microsoft hospedado ou que precisam de LDAP para aplicativos Linux</td>
              </tr>
              <tr>
                <td style="text-align:center">AD Connector</td>
                <td>Permite que usu&aacute;rios locais fa&ccedil;am login nos servi&ccedil;os da AWS com suas
                  credenciais AD existentes. Tamb&eacute;m permite que inst&acirc;ncias EC2 se juntem ao dom&iacute;nio
                  AD.</td>
                <td>Login &uacute;nico para funcion&aacute;rios locais e para adicionar inst&acirc;ncias EC2 ao
                  dom&iacute;nio</td>
              </tr>
              <tr>
                <td style="text-align:center">Simple AD</td>
                <td>Implementa&ccedil;&atilde;o AD de baixa escala e custo baseada no Samba</td>
                <td>Diret&oacute;rio de usu&aacute;rios simples ou necessidade de compatibilidade com LDAP</td>
              </tr>
            </tbody>
          </table>

          <p>Como alternativa ao servi&ccedil;o de diret&oacute;rio da AWS, voc&ecirc; pode criar seus pr&oacute;prios
            controladores de dom&iacute;nio AD da Microsoft na nuvem da AWS (no EC2).</p>

          <h2>AWS Systems Manager Parameter Store</h2>

          <p>Fornece armazenamento seguro e hier&aacute;rquico para gerenciamento de dados de configura&ccedil;&atilde;o
            e gerenciamento de segredos.</p>

          <p>&Eacute; altamente escal&aacute;vel, dispon&iacute;vel e dur&aacute;vel.</p>

          <p>Voc&ecirc; pode armazenar dados como senhas, strings de banco de dados e c&oacute;digos de licen&ccedil;a
            como valores de par&acirc;metro.</p>

          <p>Voc&ecirc; pode armazenar valores como texto simples (dados n&atilde;o criptografados) ou texto cifrado
            (dados criptografados).</p>

          <p>Voc&ecirc; pode ent&atilde;o fazer refer&ecirc;ncia a valores usando o nome exclusivo que voc&ecirc;
            especificou ao criar o par&acirc;metro.</p>

          <h2>AWS Secrets Manager</h2>

          <p>Permite a rota&ccedil;&atilde;o nativa e autom&aacute;tica de chaves.</p>

          <p>Permiss&otilde;es refinadas.</p>

          <p>Auditoria central para rota&ccedil;&atilde;o de segredos.</p>

          <h2>AWS Artifact</h2>

          <p>O&nbsp;<strong>AWS Artifact</strong>&nbsp;&eacute; seu recurso central para informa&ccedil;&otilde;es
            relacionadas &agrave; conformidade que s&atilde;o relevantes para voc&ecirc;.</p>

          <p>Ele fornece acesso sob demanda a relat&oacute;rios de seguran&ccedil;a e conformidade da AWS e a alguns
            acordos online selecionados.</p>

          <p>Os relat&oacute;rios dispon&iacute;veis no&nbsp;<strong>AWS Artifact</strong>&nbsp;incluem nossos
            relat&oacute;rios de&nbsp;<strong>Controle de Organiza&ccedil;&atilde;o de Servi&ccedil;os (SOC)</strong>,
            relat&oacute;rios da&nbsp;<strong>Ind&uacute;stria de Cart&otilde;es de Pagamento (PCI)</strong>&nbsp;e
            certifica&ccedil;&otilde;es de &oacute;rg&atilde;os de acredita&ccedil;&atilde;o em v&aacute;rias geografias
            e verticais de conformidade que validam a implementa&ccedil;&atilde;o e efic&aacute;cia operacional dos
            controles de seguran&ccedil;a da AWS.</p>

          <p>Os acordos dispon&iacute;veis no&nbsp;<strong>AWS Artifact</strong>&nbsp;incluem o&nbsp;<em>Adendo de
              Associado Comercial (BAA)</em>&nbsp;e o&nbsp;<em>Acordo de N&atilde;o Divulga&ccedil;&atilde;o (NDA)</em>.
          </p>

        </div>

        <div style="text-align: center;">
          <div>
            <button onclick="goBack()">Voltar</button>
            <script>
              function goBack() {
                window.history.back();
              }
            </script>
          </div>
        </div>

      </div>
    </div>
  </div>
  </div>

  <footer class="uk-section uk-section-secondary uk-text-center">
    <div class="uk-container uk-container-small uk-text-muted uk-link-muted">
      <div class="uk-margin-medium">
        <div data-uk-grid class="uk-child-width-auto uk-grid-small uk-flex-center uk-grid">
          <div><a href="https://www.instagram.com/vocecertificadoaws" data-uk-icon="icon: instagram"
              class="uk-icon-link uk-icon" aria-label="Instagram" rel="noopener" target="_blank"></a></div>
          <div><a href="https://www.facebook.com/VoceCertificadoAWS/" data-uk-icon="icon: facebook"
              class="uk-icon-link uk-icon" aria-label="LinkedIn" rel="noopener" target="_blank"></a></div>
          <div><a href="https://www.youtube.com/@VoceCertificadoAWS" data-uk-icon="icon: youtube"
              class="uk-icon-link uk-icon" aria-label="Youtube" rel="noopener" target="_blank"></a></div>
          <div><a href="https://www.linkedin.com/in/edulara/" data-uk-icon="icon: linkedin" class="uk-icon-link uk-icon"
              aria-label="LinkedIn" rel="noopener" target="_blank"></a></div>
        </div>
      </div>
      <div class="uk-margin-medium uk-text-small copyright">© Copyright 2023 Você Certificado: Da Nuvem à
        Certificação<br>
        ELara Você Certificado Ltda - CNPJ: 46.047.918/0001-97</div>
    </div>
  </footer>
  <div id="nav-mobile" data-uk-offcanvas="flip: true; overlay: true">
    <div class="uk-offcanvas-bar"><button class="uk-offcanvas-close" type="button" data-uk-close></button>
      <ul class="uk-nav uk-nav-primary" data-uk-scrollspy-nav="closest: li; scroll: true">
        <li><a class="uk-logo uk-margin-small-bottom" href="/"><img src="imagens/vocecertificadoaws_logo.png"
              alt="Cursos AWS"></a></li>
        <li><a href="index.html#cursos">CURSOS AWS</a></li>
        <li><a href="index.html#novidades">NOVIDADES</a></li>
        <li><a href="guias.html#guias">GUIAS DE ESTUDO</a></li>
        <li><a href="index.html#depoimentos">DEPOIMENTOS</a></li>
        <li><a href="index.html#instrutor">INSTRUTOR</a></li>
        <li><a href="index.html#faq">PERGUNTAS FREQUENTES</a></li>
        <li><a href="contato.html">CONTATO</a></li>
      </ul>
      <div class="uk-margin-small-top uk-text-center uk-text-muted uk-link-muted">
        <div data-uk-grid class="uk-child-width-auto uk-grid-small uk-flex-center uk-grid">
          <div class="uk-first-column">
            <a href="https://www.instagram.com/VoceCertificadoAWS" data-uk-icon="icon: instagram"
              class="uk-icon-link uk-icon" aria-label="Instagram" rel="noopener" target="_blank"></a>
          </div>
          <div>
            <a href="https://www.facebook.com/VoceCertificadoAWS/" data-uk-icon="icon: facebook"
              class="uk-icon-link uk-icon" aria-label="Facebook" rel="noopener" target="_blank"></a>
          </div>
          <div><a href="https://www.youtube.com/@VoceCertificadoAWS" data-uk-icon="icon: youtube"
              class="uk-icon-link uk-icon" aria-label="Youtube" rel="noopener" target="_blank"></a></div>
          <div>
            <a href="https://www.linkedin.com/in/edulara/" data-uk-icon="icon: linkedin" class="uk-icon-link uk-icon"
              aria-label="LinkedIn" rel="noopener" target="_blank"></a>
          </div>
        </div>
      </div>
    </div>
  </div>
  <script src="js/main.js"></script>

</body>

</html>