<!DOCTYPE html>
<html lang="pt-br">

<head>
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta charset="UTF-8">
  <meta content="width=device-width,initial-scale=1" name="viewport">
  <meta content="index, follow" name="robots">
  <meta content="Portuguese" name="language">
  <meta content="Eduardo Lara" name="author">


  <title>Você Certificado AWS: Da Nuvem à Certificação</title>

  <script src="https://cdn.jsdelivr.net/npm/js-cookie@3.0.1/dist/js.cookie.min.js"></script>
  <script>document.addEventListener("DOMContentLoaded", function () { if (!Cookies.get("cookie_consent")) { var e = document.createElement("div"); e.className = "cookie-consent-banner", e.innerHTML = '<p>Este site utiliza cookies do Google, para garantir a melhor experiência possível. Saiba o motivo do uso na <a href="https://policies.google.com/privacy#infocollect" target="_blank">Política de Privacidade</a>.</p><button class="cookie-consent-button">Ok, entendi</button>', document.body.appendChild(e), e.querySelector(".cookie-consent-button").addEventListener("click", function () { Cookies.set("cookie_consent", "true", { expires: 365 }), e.remove() }) } })</script>
  <script src="js/main.min.js"></script>

  <link rel="stylesheet" href="css/main.css">
  <link rel="shortcut icon" type="image/png" href="imagens/favicon.png">

  <style type="text/css">
    .cookie-consent-banner {
      position: fixed;
      bottom: 0;
      left: 0;
      width: 100%;
      background-color: #f0f0f0;
      padding: 5px;
      text-align: center;
      font-family: "Lucida Sans Unicode", "Lucida Grande", sans-serif
    }

    .cookie-consent-button {
      background-color: orange;
      border: none;
      color: #000;
      font-weight: 700;
      padding: 5px 15px;
      border-radius: 3px;
      cursor: pointer;
      font-family: "Lucida Sans Unicode", "Lucida Grande", sans-serif
    }
  </style>

</head>

<body>
  <header id="header" class="uk-position-relative uk-background-top-center uk-background-cover uk-background-norepeat"
    style="background-color:#000;background-image:url(imagens/fundo.jpg)">
    <nav class="uk-navbar-container uk-navbar-transparent uk-light">
      <div id="topo" class="uk-container">
        <div data-uk-navbar>
          <div class="uk-navbar-left"><a class="uk-navbar-item uk-logo" href="/"><img class="uk-logo-inverse"
                src="imagens/vocecertificadoaws_logo.png" alt="Cursos Você Certificado AWS"> <img
                src="imagens/vocecertificadoaws_logo.png" alt="Cursos Você Certificado AWS"></a>
            <ul class="uk-navbar-nav uk-visible@m"></ul>
          </div>
          <div class="uk-navbar-center">
            <ul class="uk-navbar-nav uk-visible@m"></ul>
          </div>
          <div class="uk-navbar-right">
            <ul class="uk-navbar-nav uk-visible@m" data-uk-scrollspy-nav="closest: li; scroll: true">
              <li><a href="index.html#cursos">CURSOS AWS</a></li>
              <li><a href="index.html#novidades">NOVIDADES</a></li>
              <li><a href="guias.html#guias">GUIAS DE ESTUDO</a></li>
              <li><a href="index.html#depoimentos">DEPOIMENTOS</a></li>
              <li><a href="index.html#instrutor">INSTRUTOR</a></li>
              <li><a href="index.html#faq">PERGUNTAS FREQUENTES</a></li>
              <li><a href="contato.html">CONTATO</a></li>
            </ul><a class="uk-navbar-toggle uk-hidden@m" href="#nav-mobile" aria-label="Mobile Navigation"
              data-uk-navbar-toggle-icon data-uk-toggle></a>
          </div>
        </div>
      </div>
    </nav>
    <div class="uk-position-relative uk-container uk-container-xsmall">
      <div class="uk-section uk-section-medium uk-width-1-1 uk-light" data-uk-parallax="y: 100;"
        data-uk-scrollspy="cls: uk-animation-slide-bottom-medium; repeat: true">
        <div class="uk-flex uk-text-center uk-flex-middle uk-flex-center">
          <div class="uk-width-1-1">
            <h1 class="uk-heading-medium" style>VOCÊ CERTIFICADO AWS</h1>
            <div class="uk-text-lead" style>Do básico ao avançado, para você passar na prova de certificação!</div>
            <div class="uk-margin-medium-top"></div>
          </div>
        </div>
      </div>
    </div>
  </header>

  <div class="uk-visible@m" uk-sticky="sel-target: .uk-navbar-container; cls-active: uk-navbar-sticky; bottom: #other">
    <nav class="uk-navbar-container" uk-navbar>
      <div class="uk-navbar-center">
        <ul class="uk-navbar-nav" data-uk-scrollspy-nav="closest: li; scroll: true; offset: 100">
          <li><a href="index.html#cursos">CURSOS AWS</a></li>
          <li><a href="index.html#novidades">NOVIDADES</a></li>
          <li><a href="guias.html#guias">GUIAS DE ESTUDO</a></li>
          <li><a href="index.html#depoimentos">DEPOIMENTOS</a></li>
          <li><a href="index.html#instrutor">INSTRUTOR</a></li>
          <li><a href="index.html#faq">PERGUNTAS FREQUENTES</a></li>
          <li><a href="contato.html">CONTATO</a></li>
        </ul>
      </div>
    </nav>
  </div>

  <div id="guias" class="uk-cover-container uk-section-muted" style>
    <div class="uk-section uk-section-large">
      <div class="uk-container uk-position-relative">
        <h2 class="uk-h1 uk-text-center">SERVIÇOS EXTRA</h2>

        <div>
          <h2><strong>COMPUTA&Ccedil;&Atilde;O</strong></h2>

<h3><strong>Amazon Elastic Container Service for Kubernetes (EKS)</strong></h3>

<ul>
	<li>Amazon Elastic Container Service for Kubernetes (EKS) &eacute; um servi&ccedil;o gerenciado Kubernetes que facilita a execu&ccedil;&atilde;o do Kubernetes na AWS sem a necessidade de instalar, operar e manter seu pr&oacute;prio plano de controle do Kubernetes.</li>
	<li>Certificado como conformante ao Kubernetes, o EKS permite que aplicativos existentes em execu&ccedil;&atilde;o no Kubernetes padr&atilde;o sejam compat&iacute;veis com o Amazon EKS.</li>
	<li>O EKS gerencia automaticamente a disponibilidade e escalabilidade dos n&oacute;s do plano de controle do Kubernetes, respons&aacute;veis por iniciar e parar cont&ecirc;ineres, agendar cont&ecirc;ineres em m&aacute;quinas virtuais, armazenar dados do cluster e outras tarefas.</li>
	<li>O EKS detecta e substitui automaticamente n&oacute;s do plano de controle n&atilde;o saud&aacute;veis para cada cluster.</li>
	<li>Geralmente dispon&iacute;vel, mas atualmente dispon&iacute;vel apenas em regi&otilde;es limitadas.</li>
</ul>

<p><a href="https://aws.amazon.com/eks/features/" target="_new">Mais informa&ccedil;&otilde;es</a></p>

<h2><strong>BANCO DE DADOS</strong></h2>

<h3><strong>Amazon Neptune</strong></h3>

<ul>
	<li>Amazon Neptune &eacute; um servi&ccedil;o de banco de dados de gr&aacute;ficos totalmente gerenciado, r&aacute;pido e confi&aacute;vel, que facilita a constru&ccedil;&atilde;o e execu&ccedil;&atilde;o de aplicativos que trabalham com conjuntos de dados altamente conectados.</li>
	<li>Com o Amazon Neptune, &eacute; poss&iacute;vel criar aplicativos de gr&aacute;ficos sofisticados e interativos que podem consultar bilh&otilde;es de rela&ccedil;&otilde;es em milissegundos.</li>
	<li>Consultas SQL para dados altamente conectados s&atilde;o complexas e dif&iacute;ceis de ajustar para o desempenho. Em vez disso, o Amazon Neptune permite o uso das linguagens de consulta de gr&aacute;ficos populares Apache TinkerPop Gremlin e SPARQL da W3C para executar consultas poderosas que s&atilde;o f&aacute;ceis de escrever e t&ecirc;m bom desempenho em dados conectados.</li>
</ul>

<p><a href="https://aws.amazon.com/neptune/features/" target="_new">Mais informa&ccedil;&otilde;es</a></p>

<h2><strong>MIGRA&Ccedil;&Atilde;O</strong></h2>

<h3><strong>AWS Migration Hub</strong></h3>

<ul>
	<li>AWS Migration Hub fornece um local &uacute;nico para acompanhar o progresso das migra&ccedil;&otilde;es de aplicativos em v&aacute;rias solu&ccedil;&otilde;es da AWS e de parceiros.</li>
	<li>Usar o Migration Hub permite escolher as ferramentas de migra&ccedil;&atilde;o da AWS e do parceiro que melhor atendem &agrave;s suas necessidades, fornecendo visibilidade sobre o status das migra&ccedil;&otilde;es em seu portf&oacute;lio de aplicativos.</li>
	<li>Por exemplo, voc&ecirc; pode usar o AWS Database Migration Service, AWS Server Migration Service e ferramentas de migra&ccedil;&atilde;o de parceiros, como ATADATA ATAmotion, CloudEndure Live Migration ou RiverMeadow Server Migration SaaS para migrar um aplicativo composto por um banco de dados, servidores web virtualizados e um servidor bare metal.</li>
	<li>Usando o Migration Hub, &eacute; poss&iacute;vel visualizar o progresso da migra&ccedil;&atilde;o de todos os recursos no aplicativo.</li>
</ul>

<p><a href="https://aws.amazon.com/migration-hub/features/" target="_new">Mais informa&ccedil;&otilde;es</a></p>

<h3><strong>SERVI&Ccedil;O DE MIGRA&Ccedil;&Atilde;O DE BANCO DE DADOS</strong></h3>

<ul>
	<li>AWS Database Migration Service ajuda a migrar bancos de dados para a AWS de forma r&aacute;pida e segura.</li>
	<li>O banco de dados de origem permanece totalmente operacional durante a migra&ccedil;&atilde;o, minimizando o tempo de inatividade para aplicativos que dependem do banco de dados.</li>
	<li>O AWS Database Migration Service pode migrar seus dados de e para a maioria dos bancos de dados amplamente utilizados comerciais e de c&oacute;digo aberto.</li>
	<li>O servi&ccedil;o oferece suporte a migra&ccedil;&otilde;es homog&ecirc;neas, como Oracle para Oracle, bem como migra&ccedil;&otilde;es heterog&ecirc;neas entre plataformas de banco de dados diferentes, como Oracle ou Microsoft SQL Server para Amazon Aurora.</li>
	<li>Com o AWS Database Migration Service, &eacute; poss&iacute;vel replicar continuamente seus dados com alta disponibilidade e consolidar bancos de dados em um data warehouse de petabytes, transmitindo dados para o Amazon Redshift e o Amazon S3.</li>
</ul>

<p><a href="https://aws.amazon.com/dms/" target="_new">Mais informa&ccedil;&otilde;es</a></p>

<h3><strong>SERVI&Ccedil;O DE MIGRA&Ccedil;&Atilde;O DE SERVIDORES</strong></h3>

<ul>
	<li>AWS Server Migration Service (SMS) &eacute; um servi&ccedil;o sem agente que facilita e acelera a migra&ccedil;&atilde;o de milhares de cargas de trabalho locais para a AWS.</li>
	<li>O AWS SMS permite automatizar, agendar e rastrear replica&ccedil;&atilde;o incremental de volumes de servidor em tempo real, facilitando a coordena&ccedil;&atilde;o de migra&ccedil;&otilde;es de servidores em grande escala.</li>
</ul>

<p><a href="https://aws.amazon.com/server-migration-service/" target="_new">Mais informa&ccedil;&otilde;es</a></p>

<h2><strong>REDE &amp; ENTREGA DE CONTE&Uacute;DO</strong></h2>

<h3><strong>Amazon API Gateway</strong></h3>

<ul>
	<li>Amazon API Gateway &eacute; um servi&ccedil;o totalmente gerenciado que facilita para os desenvolvedores criar, publicar, manter, monitorar e proteger APIs em qualquer escala.</li>
	<li>Com alguns cliques no Console de Gerenciamento da AWS, &eacute; poss&iacute;vel criar uma API que atua como uma &quot;porta de entrada&quot; para que aplicativos acessem dados, l&oacute;gica de neg&oacute;cios ou funcionalidades de seus servi&ccedil;os back-end.</li>
	<li>Servi&ccedil;os back-end podem incluir Amazon Elastic Compute Cloud (Amazon EC2), c&oacute;digo em execu&ccedil;&atilde;o no AWS Lambda ou qualquer aplicativo da web.</li>
</ul>

<p><a href="https://aws.amazon.com/api-gateway/features/" target="_new">Mais informa&ccedil;&otilde;es</a></p>

<h2><strong>SERVI&Ccedil;OS GERENCIADOS</strong></h2>

<h3><strong>AWS Managed Services</strong></h3>

<p>O AWS Managed Services oferece a gest&atilde;o cont&iacute;nua da sua infraestrutura AWS para que voc&ecirc; possa se concentrar em suas aplica&ccedil;&otilde;es.</p>

<ul>
	<li>Implementa as melhores pr&aacute;ticas para manter sua infraestrutura.</li>
	<li>Reduz sobrecarga operacional e risco.</li>
	<li>Automa&ccedil;&atilde;o de atividades comuns, como solicita&ccedil;&otilde;es de altera&ccedil;&atilde;o, monitoramento, gerenciamento de patches, seguran&ccedil;a e servi&ccedil;os de backup.</li>
	<li>Servi&ccedil;os de ciclo de vida completo para provisionar, executar e dar suporte &agrave; sua infraestrutura.</li>
</ul>

<p><a href="https://aws.amazon.com/managed-services/#" target="_new">Mais informa&ccedil;&otilde;es</a></p>

<h2><strong>AN&Aacute;LISE</strong></h2>

<h3><strong>Amazon Athena</strong></h3>

<p>Amazon Athena &eacute; um servi&ccedil;o de consulta interativo que facilita a an&aacute;lise de dados no Amazon S3 usando SQL padr&atilde;o.</p>

<ul>
	<li>Serverless, sem infraestrutura para gerenciar.</li>
	<li>Pagamento apenas pelas consultas executadas.</li>
	<li>Escalabilidade autom&aacute;tica para consultas r&aacute;pidas, mesmo com grandes conjuntos de dados e consultas complexas.</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/athena/features/" target="_new">Amazon Athena Caracter&iacute;sticas</a></p>

<h3><strong>Amazon EMR</strong></h3>

<p>Amazon Elastic MapReduce (EMR) fornece um framework Hadoop gerenciado para processar grandes volumes de dados de maneira f&aacute;cil, r&aacute;pida e econ&ocirc;mica.</p>

<ul>
	<li>Suporta frameworks distribu&iacute;dos como Apache Spark, HBase, Presto e Flink.</li>
	<li>Integra&ccedil;&atilde;o com armazenamento de dados AWS, como Amazon S3 e Amazon DynamoDB.</li>
	<li>Manuseio seguro e confi&aacute;vel de casos de uso de big data, como an&aacute;lise de logs, indexa&ccedil;&atilde;o da web, transforma&ccedil;&otilde;es de dados (ETL), aprendizado de m&aacute;quina, an&aacute;lise financeira, simula&ccedil;&atilde;o cient&iacute;fica e bioinform&aacute;tica.</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/emr/features/" target="_new">Amazon EMR Caracter&iacute;sticas</a></p>

<h3><strong>Amazon CloudSearch</strong></h3>

<p>Amazon CloudSearch &eacute; um servi&ccedil;o gerenciado na AWS que simplifica e torna acess&iacute;vel a configura&ccedil;&atilde;o, gerenciamento e escalabilidade de uma solu&ccedil;&atilde;o de pesquisa para sites ou aplicativos.</p>

<ul>
	<li>Suporta 34 idiomas e recursos populares de pesquisa, como destaque, autocompletar e pesquisa geoespacial.</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/cloudsearch/" target="_new">Amazon CloudSearch</a></p>

<h3><strong>Amazon Elasticsearch</strong></h3>

<ul>
	<li><strong>Descri&ccedil;&atilde;o:</strong>&nbsp;Amazon Elasticsearch Service &eacute; um servi&ccedil;o totalmente gerenciado que facilita implantar, proteger, operar e dimensionar o Elasticsearch para busca, an&aacute;lise e visualiza&ccedil;&atilde;o de dados em tempo real.</li>
	<li><strong>Caracter&iacute;sticas:</strong>
	<ul>
		<li>APIs f&aacute;ceis de usar e capacidades de an&aacute;lise em tempo real.</li>
		<li>Casos de uso, como an&aacute;lise de logs, pesquisa de texto completo, monitoramento de aplicativos e an&aacute;lise de fluxo de cliques.</li>
		<li>Disponibilidade, escalabilidade e seguran&ccedil;a corporativa.</li>
	</ul>
	</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/elasticsearch-service/features/" target="_new">Amazon Elasticsearch Service Caracter&iacute;sticas</a></p>

<h3><strong>Amazon Kinesis</strong></h3>

<ul>
	<li><strong>Descri&ccedil;&atilde;o:</strong>&nbsp;Amazon Kinesis facilita a coleta, processamento e an&aacute;lise de dados em tempo real, permitindo insights oportunos e rea&ccedil;&otilde;es r&aacute;pidas a novas informa&ccedil;&otilde;es.</li>
	<li><strong>Types:</strong>
	<ul>
		<li>Kinesis Video Streams: Transmiss&atilde;o segura de v&iacute;deo para an&aacute;lise e aprendizado de m&aacute;quina.</li>
		<li>Kinesis Data Streams: Constru&ccedil;&atilde;o de aplicativos personalizados para processar ou analisar dados em streaming.</li>
		<li>Kinesis Data Firehose: Carregamento f&aacute;cil de dados em fluxo cont&iacute;nuo em armazenamento e ferramentas anal&iacute;ticas.</li>
		<li>Amazon Kinesis Data Analytics: Processamento e an&aacute;lise simples de dados em streaming.</li>
	</ul>
	</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/kinesis/" target="_new">Amazon Kinesis</a></p>

<h3><strong>AWS Data Pipeline</strong></h3>

<ul>
	<li><strong>Descri&ccedil;&atilde;o:</strong>&nbsp;AWS Data Pipeline &eacute; um servi&ccedil;o da web que ajuda a processar e mover dados de maneira confi&aacute;vel entre diferentes servi&ccedil;os de computa&ccedil;&atilde;o e armazenamento AWS, bem como fontes de dados locais, em intervalos especificados.</li>
	<li><strong>Caracter&iacute;sticas:</strong>
	<ul>
		<li>Acesso regular aos dados onde est&atilde;o armazenados.</li>
		<li>Transforma&ccedil;&atilde;o e processamento em escala.</li>
		<li>Transfer&ecirc;ncia eficiente dos resultados para servi&ccedil;os AWS como Amazon S3, Amazon RDS, Amazon DynamoDB e Amazon EMR.</li>
	</ul>
	</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/datapipeline/" target="_new">AWS Data Pipeline</a></p>

<h3><strong>AWS Glue</strong></h3>

<ul>
	<li><strong>Descri&ccedil;&atilde;o:</strong>&nbsp;AWS Glue &eacute; um servi&ccedil;o totalmente gerenciado de extra&ccedil;&atilde;o, transforma&ccedil;&atilde;o e carga (ETL) que facilita a prepara&ccedil;&atilde;o e o carregamento de dados para an&aacute;lise.</li>
	<li><strong>Caracter&iacute;sticas:</strong>
	<ul>
		<li>Cria&ccedil;&atilde;o e execu&ccedil;&atilde;o de trabalhos ETL com alguns cliques no Console de Gerenciamento da AWS.</li>
		<li>Descoberta e cataloga&ccedil;&atilde;o autom&aacute;tica de dados armazenados na AWS.</li>
		<li>Gera&ccedil;&atilde;o autom&aacute;tica de c&oacute;digo para executar transforma&ccedil;&otilde;es e carregamento de dados.</li>
	</ul>
	</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/glue/features/" target="_new">AWS Glue Caracter&iacute;sticas</a></p>

<h2><strong>MEDIA SERVICES</strong></h2>

<h3><strong>Amazon Elastic Transcoder</strong></h3>

<p>Amazon Elastic Transcoder &eacute; transcodifica&ccedil;&atilde;o de m&iacute;dia na nuvem, projetada para ser altamente escal&aacute;vel, f&aacute;cil de usar e uma maneira econ&ocirc;mica para desenvolvedores e empresas converterem arquivos de m&iacute;dia de seu formato de origem para vers&otilde;es que reproduzir&atilde;o em dispositivos como smartphones, tablets e PCs.</p>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/elastictranscoder/" target="_new">Amazon Elastic Transcoder</a></p>

<h2><strong>MOBILE SERVICES</strong></h2>

<h3><strong>AWS AppSync</strong></h3>

<p>AWS AppSync facilita a constru&ccedil;&atilde;o de aplicativos m&oacute;veis e baseados em navegador orientados por dados, oferecendo experi&ecirc;ncias colaborativas e responsivas, mantendo os dados atualizados quando os dispositivos est&atilde;o conectados, permitindo que o aplicativo use dados locais quando estiver offline e sincronizando os dados quando os dispositivos se reconectam.</p>

<ul>
	<li>Usa a linguagem de consulta GraphQL padr&atilde;o para solicitar, alterar e assinar dados.</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/appsync/product-details/" target="_new">AWS AppSync Product Details</a></p>

<h3><strong>AWS Device Farm</strong></h3>

<p>AWS Device Farm &eacute; um servi&ccedil;o de teste de aplicativos que permite testar e interagir com seus aplicativos Android, iOS e web em v&aacute;rios dispositivos ao mesmo tempo, reproduzir problemas em um dispositivo em tempo real e visualizar v&iacute;deo, capturas de tela, logs e dados de desempenho para identificar e corrigir problemas.</p>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/device-farm/" target="_new">AWS Device Farm</a></p>

<h2><strong>End User Computing</strong></h2>

<h3><strong>Amazon WorkSpaces</strong></h3>

<p>Amazon WorkSpaces &eacute; um servi&ccedil;o de desktop na nuvem gerenciado e seguro. &Eacute; poss&iacute;vel provisionar desktops Windows ou Linux em apenas alguns minutos e dimensionar rapidamente para fornecer milhares de desktops a trabalhadores em todo o mundo.</p>

<ul>
	<li>Oferece uma experi&ecirc;ncia de desktop virtual segura e gerenciada na nuvem.</li>
	<li>N&atilde;o requer preocupa&ccedil;&otilde;es com a complexidade da infraestrutura, pois &eacute; totalmente gerenciado.</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/workspaces/features/" target="_new">Amazon WorkSpaces Caracter&iacute;sticas</a></p>

<h3><strong>AWS AppStream</strong></h3>

<p>Servi&ccedil;o totalmente gerenciado de streaming de aplicativos n&atilde;o persistentes.</p>

<ul>
	<li><strong>Alternativa:</strong>&nbsp;Alternativa a produtos populares, como Citrix XenApp.</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/appstream2/features/" target="_new">AWS AppStream 2.0 Caracter&iacute;sticas</a></p>

<h3><strong>AWS WorkLink</strong></h3>

<p>Oferece acesso seguro de um clique a sites e aplicativos da web internos usando navegadores de telefones celulares. N&atilde;o requer cliente VPN ou aplicativo.</p>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/worklink/features/" target="_new">AWS WorkLink Caracter&iacute;sticas</a></p>

<h3><strong>AWS WorkDocs</strong></h3>

<p>Servi&ccedil;o totalmente gerenciado de cria&ccedil;&atilde;o, armazenamento e colabora&ccedil;&atilde;o segura de conte&uacute;do. Permite criar, editar e compartilhar conte&uacute;do armazenado centralmente na AWS.</p>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/workdocs/features/" target="_new">AWS WorkDocs Caracter&iacute;sticas</a></p>

<h2><strong>INTERNET DAS COISAS (IoT)</strong></h2>

<h3><strong>AWS IoT Core</strong></h3>

<p>Descreve a rede de objetos f&iacute;sicos incorporados com sensores ou software. Cada dispositivo IoT pode se comunicar e trocar dados com outros dispositivos e sistemas.</p>

<ul>
	<li><strong>Casos de Uso:</strong>

	<ul>
		<li>Automa&ccedil;&atilde;o residencial inteligente.</li>
		<li>Sa&uacute;de inteligente.</li>
		<li>Manufatura.</li>
		<li>Agricultura.</li>
	</ul>
	</li>
	<li><strong>Caracter&iacute;sticas:</strong>
	<ul>
		<li>Conecta dispositivos IoT &agrave; nuvem AWS sem a necessidade de provisionar ou gerenciar servidores.</li>
		<li>Pode suportar bilh&otilde;es de dispositivos e trilh&otilde;es de mensagens.</li>
	</ul>
	</li>
</ul>

<p><strong>Link:</strong>&nbsp;<a href="https://aws.amazon.com/iot-core/features/" target="_new">AWS IoT Core Caracter&iacute;sticas</a></p>

        </div>

        <div style="text-align: center;">
          <div>
            <button onclick="goBack()">Voltar</button>
            <script>
              function goBack() {
                window.history.back();
              }
            </script>
          </div>
        </div>

      </div>
    </div>
  </div>
  </div>

  <footer class="uk-section uk-section-secondary uk-text-center">
    <div class="uk-container uk-container-small uk-text-muted uk-link-muted">
      <div class="uk-margin-medium">
        <div data-uk-grid class="uk-child-width-auto uk-grid-small uk-flex-center uk-grid">
          <div><a href="https://www.instagram.com/vocecertificadoaws" data-uk-icon="icon: instagram"
              class="uk-icon-link uk-icon" aria-label="Instagram" rel="noopener" target="_blank"></a></div>
          <div><a href="https://www.facebook.com/VoceCertificadoAWS/" data-uk-icon="icon: facebook"
              class="uk-icon-link uk-icon" aria-label="LinkedIn" rel="noopener" target="_blank"></a></div>
          <div><a href="https://www.youtube.com/@VoceCertificadoAWS" data-uk-icon="icon: youtube"
              class="uk-icon-link uk-icon" aria-label="Youtube" rel="noopener" target="_blank"></a></div>
          <div><a href="https://www.linkedin.com/in/edulara/" data-uk-icon="icon: linkedin" class="uk-icon-link uk-icon"
              aria-label="LinkedIn" rel="noopener" target="_blank"></a></div>
        </div>
      </div>
      <div class="uk-margin-medium uk-text-small copyright">® 2019-2023 Você Certificado: Da Nuvem à
        Certificação<br>
        ELara Você Certificado Ltda - CNPJ: 46.047.918/0001-97</div>
    </div>
  </footer>
  <div id="nav-mobile" data-uk-offcanvas="flip: true; overlay: true">
    <div class="uk-offcanvas-bar"><button class="uk-offcanvas-close" type="button" data-uk-close></button>
      <ul class="uk-nav uk-nav-primary" data-uk-scrollspy-nav="closest: li; scroll: true">
        <li><a class="uk-logo uk-margin-small-bottom" href="/"><img src="imagens/vocecertificadoaws_logo.png"
              alt="Cursos AWS"></a></li>
        <li><a href="index.html#cursos">CURSOS AWS</a></li>
        <li><a href="index.html#novidades">NOVIDADES</a></li>
        <li><a href="guias.html#guias">GUIAS DE ESTUDO</a></li>
        <li><a href="index.html#depoimentos">DEPOIMENTOS</a></li>
        <li><a href="index.html#instrutor">INSTRUTOR</a></li>
        <li><a href="index.html#faq">PERGUNTAS FREQUENTES</a></li>
        <li><a href="contato.html">CONTATO</a></li>
      </ul>
      <div class="uk-margin-small-top uk-text-center uk-text-muted uk-link-muted">
        <div data-uk-grid class="uk-child-width-auto uk-grid-small uk-flex-center uk-grid">
          <div class="uk-first-column">
            <a href="https://www.instagram.com/VoceCertificadoAWS" data-uk-icon="icon: instagram"
              class="uk-icon-link uk-icon" aria-label="Instagram" rel="noopener" target="_blank"></a>
          </div>
          <div>
            <a href="https://www.facebook.com/VoceCertificadoAWS/" data-uk-icon="icon: facebook"
              class="uk-icon-link uk-icon" aria-label="Facebook" rel="noopener" target="_blank"></a>
          </div>
          <div><a href="https://www.youtube.com/@VoceCertificadoAWS" data-uk-icon="icon: youtube"
              class="uk-icon-link uk-icon" aria-label="Youtube" rel="noopener" target="_blank"></a></div>
          <div>
            <a href="https://www.linkedin.com/in/edulara/" data-uk-icon="icon: linkedin" class="uk-icon-link uk-icon"
              aria-label="LinkedIn" rel="noopener" target="_blank"></a>
          </div>
        </div>
      </div>
    </div>
  </div>
  <script src="js/main.js"></script>

</body>

</html>